src/test/SpidMgmt/SpidMgmt_request-1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
 <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <wsa:To>http://zu-test-zf-cne-01.pnet.ch:8081/wsproxy/services/SpidManagementService/</wsa:To>
  <wsa:MessageID>urn:uuid:a6cfdc10-ce29-4d06-9f51-35835a4a0b4d</wsa:MessageID>
  <wsa:Action>http://www.zas.admin.ch</wsa:Action>
  <sense:context xmlns:sense="http://sense.ith-icoserve.com/context/" xmlns:wsctx="http://docs.oasis-open.org/ws-caf/2005/10/wsctx">
   <wsctx:context-identifier>urn:uuid:d56bdb37-bfd4-43ac-8106-23146ec1c5fa</wsctx:context-identifier>
   <wsctx:context-service>
    <sense:service>UPIProxy</sense:service>
   </wsctx:context-service>
  </sense:context>
 </soapenv:Header>
 <soapenv:Body>
  <ns11:request
          xmlns:ns11="http://www.ech.ch/xmlns/eCH-0213/1"
          xmlns:ns13="http://www.ech.ch/xmlns/eCH-0135/1"
          xmlns:ns12="http://www.ech.ch/xmlns/eCH-0006/2"
          xmlns:ns10="http://www.ech.ch/xmlns/eCH-0215/2"
          xmlns:ns9="http://www.ech.ch/xmlns/eCH-0058/5"
          xmlns:ns8="http://www.ech.ch/xmlns/eCH-0010/5"
          xmlns:ns7="http://www.ech.ch/xmlns/eCH-0021/7"
          xmlns:ns6="http://www.ech.ch/xmlns/eCH-0008/3"
          xmlns:ns5="http://www.ech.ch/xmlns/eCH-0007/5"
          xmlns:ns4="http://www.ech.ch/xmlns/eCH-0044/4"
          xmlns:ns3="http://www.ech.ch/xmlns/eCH-0011/8"
          xmlns:ns2="http://www.ech.ch/xmlns/eCH-0213-commons/1"
          minorVersion="0">
   <ns11:header>
    <ns9:senderId>sedex://T4-321574-2</ns9:senderId>
    <ns9:recipientId>sedex://T3-CH-24</ns9:recipientId>
    <ns9:messageId>63d8bda53e654b1cbf7d30067046df71</ns9:messageId>
    <ns9:messageType>1020</ns9:messageType>
    <ns9:sendingApplication>
     <ns9:manufacturer>ITH icoserve</ns9:manufacturer>
     <ns9:product>eHealth Solutions</ns9:product>
     <ns9:productVersion>VA37</ns9:productVersion>
    </ns9:sendingApplication>
    <ns9:messageDate>2020-01-10T11:07:10.610+01:00</ns9:messageDate>
    <ns9:action>5</ns9:action>
    <ns9:testDeliveryFlag>true</ns9:testDeliveryFlag>
    <ns9:responseExpected>true</ns9:responseExpected>
   </ns11:header>
   <ns11:content>
    <ns11:SPIDCategory>EPD-ID.BAG.ADMIN.CH</ns11:SPIDCategory>
    <ns11:responseLanguage>EN</ns11:responseLanguage>
    <ns11:actionOnSPID>generate</ns11:actionOnSPID>
    <ns11:pidsToUPI>
     <ns2:vn>7560520196179</ns2:vn>
    </ns11:pidsToUPI>
    <ns11:personToUPI>
     <ns2:firstName>Ylvi Lisa</ns2:firstName>
     <ns2:officialName>Ponjevic</ns2:officialName>
     <ns2:sex>2</ns2:sex>
     <ns2:dateOfBirth>
      <ns4:yearMonthDay>2005-05-18+02:00</ns4:yearMonthDay>
     </ns2:dateOfBirth>
    </ns11:personToUPI>
   </ns11:content>
  </ns11:request>
 </soapenv:Body>
</soapenv:Envelope>